Fese673/ZEGAR-ESP32/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <WiFi.h>
#include <time.h>
#include <Esp.h>
#ifdef ARDUINO_ARCH_ESP32
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <esp_heap_caps.h>
#endif

#include "STM32_Data.h"
#include "LCDMirror.h"
#include "UI_Controller.h"
#include "Encoder.h"
#include "AppState.h"
#include "UI_Draw.h"
#include "WiFiSync.h"

#include <sys/time.h>
#include "MQTTSync.h"
#include "NetworkOrchestrator.h"
#include "StatsManager.h" 
#include "AudioBT.h" 
#include "ModeManager.h"
#include "RadioModeSwitch.h"
#include "PMS_Czujnik.h"
#include "ENS160AHT21Screen.h"
#include "ENS160AHT21Sensor.h"
#include "BMP280Screen.h"
#include "BMP280Sensor.h"
#include "LCDIcons.h"
#include "AlarmMelodyPrefs.h"
#include "ClockAlarmService.h"
#include "RtcSyncService.h"
#include "TelemetryComposer.h"
#include "RuntimeTelemetry.h"
#include "RamTelemetry.h"
#include "HomeRuntime.h"
#include "AlarmTypes.h"
#include <cstring>
#include "SecretsConfig.h"
#include "BoardPins.h"
#include "i2c/SharedBus.h"
#include <Preferences.h>

// ============================================================================
// STAŁE CZASOWE (zamiast magic numbers)
// ============================================================================
constexpr unsigned long CLOCK_TICK_MS       = 1000; // tykanie zegara co 1s
constexpr unsigned long ALARM_DURATION_MS   = 60000; // jak długo gra alarm
constexpr unsigned long STM32_UPDATE_MS     = 500;  // odświeżanie danych STM32
constexpr unsigned long STM32_TIMEOUT_MS    = 3000; // timeout połączenia STM32
constexpr unsigned long STOPER_DRAW_MS      = 100;  // odświeżanie stopera
constexpr unsigned long BASELINE_REPORT_WINDOW_MS = 10000; // okno telemetrii etapu 0

// Runtime-configurable overlay switch interval (ms). Persisted via Preferences as seconds.
int settingsRotationSec = 7;               // 1..10 seconds (user-facing)
int s_prevSettingsRotationSec = 7;         // used to restore on cancel
int s_prevSettingsUiScreenIndex = 0;        // used to restore UI screen selection on cancel

extern int settingsUiScreenIndex;

constexpr uint8_t BUZZER_PIN = BoardPins::kBuzzer;

enum class IntroPhase : uint8_t {
  Idle,
  Noise,
  AuthHold,
  FrameBuild,
  Reveal,
  FlashOn,
  FlashOff,
  SuccessReady,
  SuccessRiff,
  Done,
};

static void introPrintPaddedLine(uint8_t row, const char* text);
static void introPrintCentered(uint8_t row, const char* text);
static void introPrintBorderLine(uint8_t row, char leftCorner, char rightCorner);
static void introRenderNoiseFrame();
static void renderAuthIntroFrame();
static void renderTickingFrameBase();
static void renderTickingFrameText(uint8_t revealCount);

struct BootIntroState {
  IntroPhase phase = IntroPhase::Idle;
  unsigned long phaseStartedMs = 0;
  unsigned long lastNoiseMs = 0;
  unsigned long lastRevealMs = 0;
  unsigned long flashStartedMs = 0;
  unsigned long riffStartedMs = 0;
  uint8_t revealIndex = 0;
  uint8_t flashCount = 0;
  uint8_t riffIndex = 0;
  bool backlightOn = true;
};

static BootIntroState s_intro;

static size_t boundedTextLength(const char* text, size_t maxLength) {
  if (text == nullptr) {
    return 0;
  }

  size_t length = 0;
  while (length < maxLength && text[length] != '\0') {
    ++length;
  }

  return length;
}

static void introPrintPaddedLine(uint8_t row, const char* text) {
  char line[21];
  const size_t length = boundedTextLength(text, 20);
  memset(line, ' ', 20);
  memcpy(line, text, length);
  line[20] = '\0';
  LCD_SET(0, row);
  LCD_PRINT(line);
}

static void introPrintCentered(uint8_t row, const char* text) {
  constexpr size_t width = 20;
  const size_t length = boundedTextLength(text, width);
  char line[21];
  memset(line, ' ', width);
  const size_t start = (width - length) / 2;
  memcpy(line + start, text, length);
  line[width] = '\0';
  LCD_SET(0, row);
  LCD_PRINT(line);
}

static void introPrintBorderLine(uint8_t row, char leftCorner, char rightCorner) {
  LCD_SET(0, row);
  LCD_PRINT(leftCorner);
  LCD_PRINT(F("=================="));
  LCD_PRINT(rightCorner);
}

static void introRenderNoiseFrame() {
  LCD_CLEAR();
  for (uint8_t row = 0; row < 4; ++row) {
    char line[21];
    for (uint8_t col = 0; col < 20; ++col) {
      static const char noiseChars[] = {'.', ':', '*', '#', '@', ' ', '/'};
      line[col] = noiseChars[random(0, (int)(sizeof(noiseChars) / sizeof(noiseChars[0])))];
    }
    line[20] = '\0';
    LCD_SET(0, row);
    LCD_PRINT(line);
  }
  LCD_DUMP();
}

static void renderAuthIntroFrame() {
  LCD_CLEAR();
  introPrintPaddedLine(0, "[ QUANTUM CORE OS ]");
  introPrintPaddedLine(1, "  AUTH: D.  MELCER  ");
  introPrintPaddedLine(2, "  AUTH: R. WOZNIAK  ");
  introPrintPaddedLine(3, "VERIFYING CREDENTIAL");
  LCD_DUMP();
}

static void renderTickingFrameBase() {
  LCD_CLEAR();
  introPrintBorderLine(0, '.', '.');
  LCD_SET(0, 1);
  LCD_PRINT(F("|                  |"));
  LCD_SET(0, 2);
  LCD_PRINT(F("|                  |"));
  introPrintBorderLine(3, '\'', '\'');
  LCD_DUMP();
}

static void renderTickingFrameText(uint8_t revealCount) {
  static const char kTicking[] = "TICKING";
  static const char kBomb[] = "BOMB";
  char row1[19];
  char row2[19];
  memset(row1, ' ', 18);
  memset(row2, ' ', 18);
  row1[18] = '\0';
  row2[18] = '\0';

  const uint8_t tickingVisible = revealCount < 7 ? revealCount : 7;
  const uint8_t bombVisible = revealCount > 7 ? (uint8_t)((revealCount - 7) < 4 ? (revealCount - 7) : 4) : 0;
  const uint8_t tickingStart = (18 - 7) / 2;
  const uint8_t bombStart = (18 - 4) / 2;

  memcpy(row1 + tickingStart, kTicking, tickingVisible);
  memcpy(row2 + bombStart, kBomb, bombVisible);

  introPrintBorderLine(0, '.', '.');
  LCD_SET(0, 1);
  LCD_PRINT(F("|"));
  LCD_PRINT(row1);
  LCD_PRINT(F("|"));
  LCD_SET(0, 2);
  LCD_PRINT(F("|"));
  LCD_PRINT(row2);
  LCD_PRINT(F("|"));
  introPrintBorderLine(3, '\'', '\'');
  LCD_DUMP();
}

static void introBegin() {
  randomSeed((uint32_t)micros());
  s_intro = BootIntroState{};
  s_intro.phase = IntroPhase::Noise;
  s_intro.phaseStartedMs = millis();
  s_intro.backlightOn = true;
}

static bool serviceEpicBootSequence() {
  if (s_intro.phase == IntroPhase::Idle || s_intro.phase == IntroPhase::Done) {
    return false;
  }

  const unsigned long nowMs = millis();
  switch (s_intro.phase) {
    case IntroPhase::Noise:
      if (s_intro.lastNoiseMs == 0 || (nowMs - s_intro.lastNoiseMs) >= 90UL) {
        introRenderNoiseFrame();
        s_intro.lastNoiseMs = nowMs;
      }
      if ((nowMs - s_intro.phaseStartedMs) >= 1800UL) {
        renderAuthIntroFrame();
        tone(BUZZER_PIN, 1760, 70);
        s_intro.phase = IntroPhase::AuthHold;
        s_intro.phaseStartedMs = nowMs;
      }
      break;

    case IntroPhase::AuthHold:
      if ((nowMs - s_intro.phaseStartedMs) >= 3000UL) {
        s_intro.phase = IntroPhase::FrameBuild;
        s_intro.phaseStartedMs = nowMs;
      }
      break;

    case IntroPhase::FrameBuild:
      renderTickingFrameBase();
      tone(BUZZER_PIN, 140, 120);
      s_intro.revealIndex = 0;
      s_intro.phase = IntroPhase::Reveal;
      s_intro.phaseStartedMs = nowMs;
      s_intro.lastRevealMs = nowMs;
      break;

