Fese673/ZEGAR-ESP32/src/main.cpp
constexpr int SETTINGS_MENU_COUNT = 9;
int settingsMenuCount = SETTINGS_MENU_COUNT;

// --- Menu: Synchronizacja ---
int settingsSyncMinutes = 60;
int s_prevSettingsSyncMin = 60;

// --- Menu Ustawienia UI EKRAN ---
const char* settingsUiScreenItems[] = {
  "Minimal",
  "Balanced",
  "Extreme"
};
constexpr int SETTINGS_UI_SCREEN_COUNT = 3;
int settingsUiScreenCount = SETTINGS_UI_SCREEN_COUNT;

// --- Menu Ustawienia PMS5003 ---
int settingsPmsMenuIndex = 0;
const char* settingsPmsMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_PMS_MENU_COUNT = 2;
int settingsPmsMenuCount = SETTINGS_PMS_MENU_COUNT;

// --- Menu Ustawienia Buzera ---
int settingsBuzzerMenuIndex = 0;
const char* settingsBuzzerMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_BUZZER_MENU_COUNT = 2;
int settingsBuzzerMenuCount = SETTINGS_BUZZER_MENU_COUNT;

// --- Menu Ustawienia MQTT ---
int settingsMqttMenuIndex = 0;
const char* settingsMqttMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_MQTT_MENU_COUNT = 2;
int settingsMqttMenuCount = SETTINGS_MQTT_MENU_COUNT;

// --- PMS5003 Telemetry ---
uint16_t pms5003_errorCount_current = 0;
uint16_t pms5003_errorCount_total = 0;
uint16_t pms5003_bytesReceived = 0;
uint32_t pms5003_lastFrameTime = 0;
uint32_t pms5003_latency_ms = 0;

// --- PMS5003 Current Values ---
uint16_t pms5003_PM1_0_CF1 = 0;
uint16_t pms5003_PM2_5_CF1 = 0;
uint16_t pms5003_PM10_CF1 = 0;

uint16_t pms5003_PM1_0_ATM = 0;

static void drawHomeThrottled() {
  HomeRuntime::markHomeDirty();
  HomeRuntime::serviceRedraw(appState);
}

void setHomeUiProfile(uint8_t profileIndex) {
  HomeRuntime::setProfile(profileIndex);
  settingsUiScreenIndex = (int)HomeRuntime::getProfile();
}

static bool looksLikePlaceholder(const String& value) {
  return value.length() == 0 || value.startsWith("REPLACE_");
}

static void loadNetworkConfigFromPreferences() {
  s_wifiSsid = s_prefs.isKey("wifiSsid") ? s_prefs.getString("wifiSsid", PROJECT_WIFI_SSID) : PROJECT_WIFI_SSID;
  s_wifiPass = s_prefs.isKey("wifiPass") ? s_prefs.getString("wifiPass", PROJECT_WIFI_PASS) : PROJECT_WIFI_PASS;
  s_ntpServer = s_prefs.isKey("ntpServer") ? s_prefs.getString("ntpServer", PROJECT_NTP_SERVER) : PROJECT_NTP_SERVER;

  s_mqttConfig.brokerAddress = s_prefs.isKey("mqttHost") ? s_prefs.getString("mqttHost", PROJECT_MQTT_BROKER) : PROJECT_MQTT_BROKER;
  s_mqttConfig.brokerPort = (uint16_t)s_prefs.getUShort("mqttPort", PROJECT_MQTT_PORT);
  s_mqttConfig.username = s_prefs.isKey("mqttUser") ? s_prefs.getString("mqttUser", PROJECT_MQTT_USERNAME) : PROJECT_MQTT_USERNAME;
  s_mqttConfig.password = s_prefs.isKey("mqttPass") ? s_prefs.getString("mqttPass", PROJECT_MQTT_PASSWORD) : PROJECT_MQTT_PASSWORD;
  s_mqttConfig.topic = s_prefs.isKey("mqttTopic") ? s_prefs.getString("mqttTopic", PROJECT_MQTT_TOPIC) : PROJECT_MQTT_TOPIC;
  s_mqttConfig.clientId = s_prefs.isKey("mqttClient") ? s_prefs.getString("mqttClient", PROJECT_MQTT_CLIENT_ID) : PROJECT_MQTT_CLIENT_ID;

  if (looksLikePlaceholder(s_wifiSsid) || looksLikePlaceholder(s_wifiPass)) {
    Serial.println("[config] WiFi credentials are placeholders; configure NVS keys wifiSsid/wifiPass.");
  }

  if (looksLikePlaceholder(s_mqttConfig.brokerAddress) ||
      looksLikePlaceholder(s_mqttConfig.username) ||
      looksLikePlaceholder(s_mqttConfig.password)) {
    Serial.println("[config] MQTT credentials are placeholders; configure NVS keys mqttHost/mqttUser/mqttPass.");
  }
}

void startAlarmMelodyDemo(uint8_t melodyIndex) {
  ClockAlarmService::startAlarmMelodyDemo(melodyIndex, BUZZER_PIN);
}

void stopAlarmMelodyDemo() {
  ClockAlarmService::stopAlarmMelodyDemo(BUZZER_PIN);
}

uint16_t pms5003_PM2_5_ATM = 0;
uint16_t pms5003_PM10_ATM = 0;

// --- Dane PMS5003 HISTORYCZNE (min/max) - TRYB CF=1 ---
uint16_t pms5003_PM1_0_CF1_MIN = 9999;  uint16_t pms5003_PM1_0_CF1_MAX = 0;
uint16_t pms5003_PM2_5_CF1_MIN = 9999;  uint16_t pms5003_PM2_5_CF1_MAX = 0;
uint16_t pms5003_PM10_CF1_MIN = 9999;   uint16_t pms5003_PM10_CF1_MAX = 0;

// --- Dane PMS5003 HISTORYCZNE (min/max) - TRYB ATMOSFERYCZNY ---
uint16_t pms5003_PM1_0_ATM_MIN = 9999;  uint16_t pms5003_PM1_0_ATM_MAX = 0;
uint16_t pms5003_PM2_5_ATM_MIN = 9999;  uint16_t pms5003_PM2_5_ATM_MAX = 0;
uint16_t pms5003_PM10_ATM_MIN = 9999;   uint16_t pms5003_PM10_ATM_MAX = 0;

// --- Dane PMS5003 LICZBA CZĄSTEK (#/100cm³) - BIEŻĄCE ---
uint16_t pms5003_particleCount_0_3 = 0;
uint16_t pms5003_particleCount_0_5 = 0;
uint16_t pms5003_particleCount_1_0 = 0;
uint16_t pms5003_particleCount_2_5 = 0;
uint16_t pms5003_particleCount_5_0 = 0;
uint16_t pms5003_particleCount_10_0 = 0;

// --- Dane PMS5003 LICZBA CZĄSTEK (min/max) ---
uint16_t pms5003_particleCount_0_3_MIN = 9999;  uint16_t pms5003_particleCount_0_3_MAX = 0;
uint16_t pms5003_particleCount_0_5_MIN = 9999;  uint16_t pms5003_particleCount_0_5_MAX = 0;
uint16_t pms5003_particleCount_1_0_MIN = 9999;  uint16_t pms5003_particleCount_1_0_MAX = 0;
uint16_t pms5003_particleCount_2_5_MIN = 9999;  uint16_t pms5003_particleCount_2_5_MAX = 0;
uint16_t pms5003_particleCount_5_0_MIN = 9999;  uint16_t pms5003_particleCount_5_0_MAX = 0;
uint16_t pms5003_particleCount_10_0_MIN = 9999; uint16_t pms5003_particleCount_10_0_MAX = 0;

// --- Heap Usage Tracking (used by system resources view) ---
uint8_t heapUsagePercent = 0;
uint8_t heapUsageCore0Percent = 0;
uint8_t heapUsageCore1Percent = 0;
static unsigned long lastCpuReadTime = 0;

// --- System Resources Tracking ---
uint32_t ramFreeBytes = 0;
uint32_t ramTotalBytes = 0;
uint32_t ramLargestBlockBytes = 0;
uint32_t ramMinFreeBytes = 0;
uint32_t ramDmaFreeBytes = 0;
uint32_t flashFreeBytes = 0;

// --- Ustawienia (Configuration settings) ---
bool pms5003Enabled = true;   // Czy czujnik PMS5003 jest włączony
bool buzzerEnabled = true;    // Czy buzzer jest włączony

// --- Budzik ---
int  alarmHour       = 7;
int  alarmMinute     = 0;
bool alarmEnabled    = false;
bool alarmRinging    = false;
unsigned long alarmStartTime  = 0;

// --- Multi-alarm storage ---
const int MAX_ALARMS = 8;
AlarmEntry alarms[MAX_ALARMS];
int alarmsCount = 0; // number of configured alarms
int alarmsMenuIndex = 0; // selection in list view
int selectedAlarmIndex = 0; // index for editing/deleting
int alarmEditCursor = 0; // 0=CZAS,1=STATUS,2=USUN

// --- Minutnik (Timer) ---
int  timerSetMinutes  = 0;    // ustawiane przez użytkownika
int  timerSetSeconds  = 0;
bool timerRunning     = false;
unsigned long timerStartMillis = 0;
unsigned long timerDurationMs  = 0;

int  timerSetHours    = 0;
int  timerUiCursor    = 0; // 0=CZAS, 1=PRESETY
int  timerPresetIndex = 1; // default highlight: 15m

// --- STM32 DANE (UART) ---
int  displayedBPM    = 0;
int  displayedSPO2   = 0;
bool stm32Connected  = false;

// --- Stoper ---
bool stoperRunning         = false;
unsigned long stoperStart  = 0;
unsigned long stoperElapsed = 0;

// --- Czas (HH:MM:SS) ---
int hours   = 12;
int minutes = 0;
int seconds = 0;
unsigned long lastTick = 0;

// --- MQTT Mode Control ---
bool mqttEnabled = true;

// Flaga do wymuszenia rysowania ekranów PMS5003 przy wejściu do podmenu
bool pmsScreenDirty = true;

