Fese673/ZEGAR-ESP32/src/main.cpp
struct MainRuntimeState {
  bool bootDiagReprinted = false;
  unsigned long lastSTM32Update = 0;
  unsigned long lastSTM32DataReceived = 0;
  unsigned long lastStoperDraw = 0;
};

static MainRuntimeState s_runtimeState;

struct LoopBaselineTelemetry {
  unsigned long windowStartedMs = 0;
  unsigned long loopCount = 0;
  uint32_t lastLoopStartUs = 0;
  uint32_t lastLoopPeriodUs = 0;
  uint32_t minLoopPeriodUs = 0xFFFFFFFFUL;
  uint32_t maxLoopPeriodUs = 0;
  uint32_t maxLoopJitterUs = 0;
  uint32_t maxLoopBodyUs = 0;
  uint32_t maxUiRefreshUs = 0;
  uint32_t maxMqttPublishUs = 0;
  uint32_t maxNetworkUpdateUs = 0;
  uint32_t minFreeHeapBytes = 0xFFFFFFFFUL;
};

static LoopBaselineTelemetry s_loopBaseline;

static uint32_t deltaUs(uint32_t startUs, uint32_t endUs) {
  return (uint32_t)(endUs - startUs);
}

static uint32_t absDiffU32(uint32_t a, uint32_t b) {
  return (a >= b) ? (a - b) : (b - a);
}

static void recordMaxU32(uint32_t& target, uint32_t sample) {
  if (sample > target) {
    target = sample;
  }
}

static void baselineResetWindow(unsigned long nowMs) {
  s_loopBaseline.windowStartedMs = nowMs;
  s_loopBaseline.loopCount = 0;
  s_loopBaseline.minLoopPeriodUs = 0xFFFFFFFFUL;
  s_loopBaseline.maxLoopPeriodUs = 0;
  s_loopBaseline.maxLoopJitterUs = 0;
  s_loopBaseline.maxLoopBodyUs = 0;
  s_loopBaseline.maxUiRefreshUs = 0;
  s_loopBaseline.maxMqttPublishUs = 0;
  s_loopBaseline.maxNetworkUpdateUs = 0;
  s_loopBaseline.minFreeHeapBytes = 0xFFFFFFFFUL;
}

static void baselineOnLoopStart(unsigned long nowMs, uint32_t nowUs) {
  if (s_loopBaseline.windowStartedMs == 0) {
    baselineResetWindow(nowMs);
  }

  if (s_loopBaseline.lastLoopStartUs != 0) {
    const uint32_t periodUs = deltaUs(s_loopBaseline.lastLoopStartUs, nowUs);
    if (periodUs < s_loopBaseline.minLoopPeriodUs) {
      s_loopBaseline.minLoopPeriodUs = periodUs;
    }
    if (periodUs > s_loopBaseline.maxLoopPeriodUs) {
      s_loopBaseline.maxLoopPeriodUs = periodUs;
    }
    if (s_loopBaseline.lastLoopPeriodUs != 0) {
      const uint32_t jitterUs = absDiffU32(periodUs, s_loopBaseline.lastLoopPeriodUs);
      if (jitterUs > s_loopBaseline.maxLoopJitterUs) {
        s_loopBaseline.maxLoopJitterUs = jitterUs;
      }
    }
    s_loopBaseline.lastLoopPeriodUs = periodUs;
  }

  s_loopBaseline.lastLoopStartUs = nowUs;
  const uint32_t freeHeap = ESP.getFreeHeap();
  if (freeHeap < s_loopBaseline.minFreeHeapBytes) {
    s_loopBaseline.minFreeHeapBytes = freeHeap;
  }
}

static void baselineOnLoopEnd(unsigned long nowMs, uint32_t loopStartUs, uint32_t loopEndUs) {
  recordMaxU32(s_loopBaseline.maxLoopBodyUs, deltaUs(loopStartUs, loopEndUs));
  ++s_loopBaseline.loopCount;

  if ((nowMs - s_loopBaseline.windowStartedMs) < BASELINE_REPORT_WINDOW_MS) {
    return;
  }

  const uint32_t minPeriodUs = (s_loopBaseline.minLoopPeriodUs == 0xFFFFFFFFUL) ? 0UL : s_loopBaseline.minLoopPeriodUs;
  const uint32_t minHeapBytes = (s_loopBaseline.minFreeHeapBytes == 0xFFFFFFFFUL) ? ESP.getFreeHeap() : s_loopBaseline.minFreeHeapBytes;
  Serial.printf(
      "[BASELINE] win=%lums loops=%lu loop_us[min=%lu max=%lu jitter=%lu body_max=%lu] ui_max=%lu net_max=%lu mqtt_max=%lu heap_min=%lu\n",
      (unsigned long)(nowMs - s_loopBaseline.windowStartedMs),
      s_loopBaseline.loopCount,
      (unsigned long)minPeriodUs,
      (unsigned long)s_loopBaseline.maxLoopPeriodUs,
      (unsigned long)s_loopBaseline.maxLoopJitterUs,
      (unsigned long)s_loopBaseline.maxLoopBodyUs,
      (unsigned long)s_loopBaseline.maxUiRefreshUs,
      (unsigned long)s_loopBaseline.maxNetworkUpdateUs,
      (unsigned long)s_loopBaseline.maxMqttPublishUs,
      (unsigned long)minHeapBytes);

  baselineResetWindow(nowMs);
}

struct RuntimeContext {
  int& hours;
  int& minutes;
  int& seconds;
  unsigned long& lastTick;
  bool& mqttEnabled;
  int& settingsRotationSec;
  int& settingsUiScreenIndex;
  int& settingsMqttMenuIndex;
  int& settingsAlarmMelodyIndex;
  int& prevSettingsAlarmMelodyIndex;
  int& prevSettingsRotationSec;
  int& prevSettingsUiScreenIndex;
  int& alarmsCount;
  MainRuntimeState& state;
};

static RuntimeContext makeRuntimeContext() {
  return RuntimeContext{
      hours,
      minutes,
      seconds,
      lastTick,
      mqttEnabled,
      settingsRotationSec,
      settingsUiScreenIndex,
      settingsMqttMenuIndex,
      settingsAlarmMelodyIndex,
      s_prevSettingsAlarmMelodyIndex,
      s_prevSettingsRotationSec,
      s_prevSettingsUiScreenIndex,
      alarmsCount,
      s_runtimeState,
  };
}

static bool restoreRtcHandoffTime(RuntimeContext& ctx, unsigned long nowMs, bool refreshHomeUi);

static void initCoreHardware();
static void initPersistenceAndConfig(RuntimeContext& ctx);
static void initUiAndInput();
static void initSensors(RuntimeContext& ctx);
static void initComms(RuntimeContext& ctx);
static void finalizeStartup(RuntimeContext& ctx);

static void serviceBootDiagnostics(RuntimeContext& ctx, unsigned long nowMs);
static void serviceInputAndUiEvents(RuntimeContext& ctx, unsigned long nowMs);
static void serviceUiRefreshPreSensors(RuntimeContext& ctx, unsigned long nowMs);
static void serviceSensors(RuntimeContext& ctx, unsigned long nowMs);
static void serviceUiRefresh(RuntimeContext& ctx, unsigned long nowMs);
static void serviceDiagnostics(RuntimeContext& ctx, unsigned long nowMs);
static void serviceComms(RuntimeContext& ctx, unsigned long nowMs);
static void serviceStm32AndStopwatch(RuntimeContext& ctx, unsigned long nowMs);
static void serviceDiagnosticsTail(RuntimeContext& ctx, unsigned long nowMs);

// ============================================================================
// MONITOROWANIE ZASOBÓW SYSTEMU
// ============================================================================

void updateSystemResources() {
  unsigned long currentTime = millis();
  
  // Aktualizuj co ~1 sekundę
  if (currentTime - lastCpuReadTime < 1000) {
    return;
  }
  
  lastCpuReadTime = currentTime;
  
  // --- Heap usage ratio (historically shown on CPU screen) ---
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();

