Fese673/ZEGAR-ESP32/src/main.cpp
  uint32_t usedHeap = totalHeap - freeHeap;
  if (totalHeap == 0) {
    heapUsagePercent = 0;
  } else {
    heapUsagePercent = (uint8_t)((usedHeap * 100U) / totalHeap);
  }

  if (heapUsagePercent > 80) {
    heapUsageCore0Percent = heapUsagePercent - 5;
    heapUsageCore1Percent = heapUsagePercent;
  } else if (heapUsagePercent > 60) {
    heapUsageCore0Percent = heapUsagePercent + 5;
    heapUsageCore1Percent = heapUsagePercent - 5;
  } else {
    heapUsageCore0Percent = heapUsagePercent + 10;
    heapUsageCore1Percent = heapUsagePercent;
  }

  if (heapUsageCore0Percent > 100) heapUsageCore0Percent = 100;
  if (heapUsageCore1Percent > 100) heapUsageCore1Percent = 100;
  
  // --- RAM Free ---
  ramFreeBytes = freeHeap;
  ramTotalBytes = totalHeap;
  
#ifdef ARDUINO_ARCH_ESP32
  ramLargestBlockBytes = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
  ramMinFreeBytes = ESP.getMinFreeHeap();
  ramDmaFreeBytes = heap_caps_get_free_size(MALLOC_CAP_DMA);
#else
  ramLargestBlockBytes = 0;
  ramMinFreeBytes = ramFreeBytes;
  ramDmaFreeBytes = 0;
#endif

  // --- Flash Free ---
  flashFreeBytes = ESP.getFreeSketchSpace();
}

// ============================================================================
// SETUP
// ============================================================================

static bool restoreRtcHandoffTime(RuntimeContext& ctx, unsigned long nowMs, bool refreshHomeUi) {
  const uint8_t rtcHours = RadioModeSwitch::getRTCHours();
  const uint8_t rtcMinutes = RadioModeSwitch::getRTCMinutes();
  const uint8_t rtcSeconds = RadioModeSwitch::getRTCSeconds();

  if (rtcHours == 0 && rtcMinutes == 0 && rtcSeconds == 0) {
    return false;
  }

  if (rtcHours < 24 && rtcMinutes < 60 && rtcSeconds < 60) {
    ctx.hours = rtcHours;
    ctx.minutes = rtcMinutes;
    ctx.seconds = rtcSeconds;
    ctx.lastTick = nowMs;
    Serial.printf("[main] Restore time from RTC handoff: %02d:%02d:%02d\n", ctx.hours, ctx.minutes, ctx.seconds);
    updateSevenSeg();
    if (refreshHomeUi) {
      drawHomeThrottled();
    }
    RadioModeSwitch::clearRTCTime();
    return true;
  }

  Serial.printf("[main] Invalid RTC handoff time: %02d:%02d:%02d - ignoring\n", rtcHours, rtcMinutes, rtcSeconds);
  RadioModeSwitch::clearRTCTime();
  return false;
}

static void initCoreHardware() {
  Serial.begin(UART_BAUD);
#ifdef ARDUINO_ARCH_ESP32
  vTaskDelay(pdMS_TO_TICKS(SETUP_DELAY_MS));
#else
  const unsigned long setupWaitUntilMs = millis() + SETUP_DELAY_MS;
  while ((long)(millis() - setupWaitUntilMs) < 0) {
    yield();
  }
#endif

  RtcSyncService::applyTimezone();
  heapBaseline = ESP.getFreeHeap();
  Serial.printf("[diag] baseline_heap=%u\n", heapBaseline);
  ModeManager::logDiag("boot");
  RamTelemetry::begin();

  ModeManager::begin(&appState);
  RAM_CHECKPOINT("BOOT");

  // Ensure 7-seg GPIO is configured before any early time restoration.
  initSevenSeg();
}

static void initPersistenceAndConfig(RuntimeContext& ctx) {
  s_prefs.begin("zegar", false);
  loadNetworkConfigFromPreferences();
  showEpicIntro = s_prefs.getBool("epicIntro", true);
  settingsEpicIntroIndex = showEpicIntro ? 0 : 1;

  RadioModeSwitch::begin();
  restoreRtcHandoffTime(ctx, millis(), false);
}

static void initUiAndInput() {
#if UART_LCD_MIRROR
  lcdMirror.begin();
#endif
  lcdFrame.begin();

  const bool i2cClockApplied = I2cShared::initMaster(&Wire,
                                                     BoardPins::kI2cSda,
                                                     BoardPins::kI2cScl,
                                                     BoardPins::kI2cClockHz);
  Serial.printf("[main] I2C clock readback: %lu Hz (%s)\n",
                (unsigned long)Wire.getClock(),
                i2cClockApplied ? "applied" : "fallback/mismatch");
  RAM_CHECKPOINT("I2C_READY");

  RtcSyncService::tryRestoreSystemTimeFromDs3231(hours, minutes, seconds, lastTick);

  lcd.setExecTimes(37, 1520);
  lcd.init();
  lcd.backlight();
  lcd.clear();
  lcdFrame.syncToCurrentFrame();
  LCDIcons::loadPalette(lcd, LCDIcons::Palette::Home);

  const bool skipIntroAfterModeHandoff = RadioModeSwitch::wasBootHandoffDetected();
  if (showEpicIntro && !skipIntroAfterModeHandoff) {
    introBegin();
  } else if (showEpicIntro && skipIntroAfterModeHandoff) {
    Serial.println("[main] Boot intro skipped after radio mode handoff restart");
  }

  encoder_begin(ENC_CLK, ENC_DT, ENC_SW);
  pinMode(BUZZER_PIN, OUTPUT);
  statsManager.begin();
}

static void initSensors(RuntimeContext& ctx) {
  STM32data_begin(uart, UART_BAUD, BoardPins::kStm32UartRx, BoardPins::kStm32UartTx);

  PMS5003Sensor::begin();
  ENS160AHT21Screen::resetRuntimeData();
  ENS160AHT21Sensor::begin();
  BMP280Sensor::begin();
  bmp280MenuCount = BMP280Sensor::menuItemCount();
  RAM_CHECKPOINT("SENSORS_INIT");

  HomeRuntime::DrawCallbacks homeDrawCallbacks;
  homeDrawCallbacks.drawHome = drawHome;
  homeDrawCallbacks.drawIndoorWeather = drawIndoorWeatherScreen;
  homeDrawCallbacks.drawOutdoorAir = drawAirScreen;
  homeDrawCallbacks.drawExtremeEnvironment = drawExtremeEnvironmentScreen;
  homeDrawCallbacks.drawSystemResources = drawSystemResources;
  homeDrawCallbacks.drawExtremeAlgorithms = drawExtremeAlgorithmScreen;
  HomeRuntime::begin(homeDrawCallbacks, (uint8_t)ctx.settingsUiScreenIndex, (uint8_t)ctx.settingsRotationSec);
  RAM_CHECKPOINT("UI_READY");
}

static void initComms(RuntimeContext& ctx) {
  UI_Callbacks callbacks;
  callbacks.drawHome = drawHomeThrottled;
  callbacks.drawMenu = drawMenu;
  callbacks.drawSetTime = drawSetTime;
  callbacks.drawAlarm = drawAlarm;
  callbacks.drawTimer = drawTimer;
  callbacks.drawStoper = drawStoper;
  callbacks.drawDebugSTM32 = drawDebugSTM32;
  callbacks.updateSevenSeg = updateSevenSeg;
  callbacks.updateSevenSegStoper = updateSevenSegStoper;
  callbacks.drawStats = drawStats;
  callbacks.drawSystemResources = drawSystemResources;
  callbacks.setHomeUiProfile = setHomeUiProfile;

  lcdFrame.forceFullRedrawOnce();
  ui_begin(callbacks);
  lcd.backlight();

#if CORE_DEBUG_LEVEL > 0
  lcdFrame.reportTiming("startup");
#endif

