Fese673/ZEGAR-ESP32/src/main.cpp
  ctx.settingsRotationSec = s_prefs.getUShort("homeOverlaySec", (uint16_t)ctx.settingsRotationSec);
  if (ctx.settingsRotationSec < 1) ctx.settingsRotationSec = 1;
  if (ctx.settingsRotationSec > 10) ctx.settingsRotationSec = 10;
  HomeRuntime::setOverlayIntervalSeconds((uint8_t)ctx.settingsRotationSec);
  ctx.prevSettingsRotationSec = ctx.settingsRotationSec;

  ctx.settingsAlarmMelodyIndex = AlarmMelodyPrefs::loadIndex(s_prefs);
  ctx.prevSettingsAlarmMelodyIndex = ctx.settingsAlarmMelodyIndex;

  ctx.settingsUiScreenIndex = (int)s_prefs.getUShort("uiScreenMode", (uint16_t)ctx.settingsUiScreenIndex);
  if (ctx.settingsUiScreenIndex < 0) ctx.settingsUiScreenIndex = 0;
  if (ctx.settingsUiScreenIndex > 2) ctx.settingsUiScreenIndex = 2;
  setHomeUiProfile((uint8_t)ctx.settingsUiScreenIndex);
  ctx.prevSettingsUiScreenIndex = ctx.settingsUiScreenIndex;

  ctx.mqttEnabled = s_prefs.getBool("mqttEnabled", true);
  ctx.settingsMqttMenuIndex = ctx.mqttEnabled ? 0 : 1;

  ctx.alarmsCount = s_prefs.getUShort("alarmCount", 0);
  if (ctx.alarmsCount < 0) ctx.alarmsCount = 0;
  if (ctx.alarmsCount > MAX_ALARMS) ctx.alarmsCount = MAX_ALARMS;
  for (int i = 0; i < ctx.alarmsCount; ++i) {
    char keyH[12];
    char keyM[12];
    char keyE[12];
    snprintf(keyH, sizeof(keyH), "a%dh", i);
    snprintf(keyM, sizeof(keyM), "a%dm", i);
    snprintf(keyE, sizeof(keyE), "a%de", i);
    alarms[i].hour = (uint8_t)s_prefs.getUShort(keyH, 7);
    alarms[i].minute = (uint8_t)s_prefs.getUShort(keyM, 0);
    alarms[i].enabled = s_prefs.getBool(keyE, true);
    alarms[i].lastTriggerDay = 0;
  }

  WiFiSync::setTimeRefs(ctx.hours, ctx.minutes, ctx.seconds, ctx.lastTick);
  WiFiSync::setOnDone([]() {
    const unsigned long ntpSyncMs = WiFiSync::getLastNtpSyncTime();
    RtcSyncService::noteNtpSync(ntpSyncMs);
    drawHomeThrottled();
  });
  WiFiSync::begin(s_wifiSsid.c_str(), s_wifiPass.c_str(), s_ntpServer.c_str());

  MQTTSync::configure(s_mqttConfig);

  NetworkOrchestrator::Config netCfg;
  netCfg.wifiSsid = s_wifiSsid.c_str();
  netCfg.wifiPass = s_wifiPass.c_str();
  netCfg.wifiStatusCheckMs = 2000UL;
  NetworkOrchestrator::begin(netCfg);
  NetworkOrchestrator::setMqttEnabled(ctx.mqttEnabled);
  Serial.println("[main] Network orchestrator armed (WiFi/Radio/MQTT)");
  RAM_CHECKPOINT("NETWORK_INIT");
}

static void finalizeStartup(RuntimeContext& ctx) {
  (void)ctx;
  if (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

  ModeManager::logDiag("after-setup-radio-ready");
  RAM_CHECKPOINT("SETUP_DONE");
}

void setup() {
  RuntimeContext ctx = makeRuntimeContext();
  initCoreHardware();
  initPersistenceAndConfig(ctx);
  initUiAndInput();
  initSensors(ctx);
  initComms(ctx);
  finalizeStartup(ctx);
}

// ============================================================================
// LOOP SERVICES (ETAP 1)
// ============================================================================

static void serviceBootDiagnostics(RuntimeContext& ctx, unsigned long nowMs) {
  if (!ctx.state.bootDiagReprinted && nowMs >= 5000UL) {
    ctx.state.bootDiagReprinted = true;
    Serial.printf("[boot] serial alive, i2c=%lu Hz, heap=%u\n",
                  (unsigned long)Wire.getClock(),
                  ESP.getFreeHeap());
  }
}

static void serviceInputAndUiEvents(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  HomeRuntime::handleHomeEntryIfStateChanged(appState);

  while (true) {
    const EncoderEvent evt = encoder_update();
    if (evt == ENC_NONE) {
      break;
    }

    if (evt == ENC_CLICK || evt == ENC_LONG) {
      statsManager.registerClick();
    } else if (evt == ENC_LEFT) {
      statsManager.registerStepLeft();
    } else if (evt == ENC_RIGHT) {
      statsManager.registerStepRight();
    }

    if (!RadioModeSwitch::isInitializing()) {
      ui_handleEvent(evt);
    }
  }

  statsManager.update();
}

static void serviceUiRefreshPreSensors(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  const uint32_t refreshStartUs = micros();
  HomeRuntime::serviceOverlayRotation(appState);
  HomeRuntime::serviceRedraw(appState);
  recordMaxU32(s_loopBaseline.maxUiRefreshUs, deltaUs(refreshStartUs, micros()));
}

static void serviceSensors(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  updateSystemResources();
  PMS5003Sensor::update();
  ENS160AHT21Sensor::update();
  BMP280Sensor::update();
}

static void serviceUiRefresh(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  const uint32_t refreshStartUs = micros();

  static unsigned long lastStatsRedraw = 0;
  if ((appState == STATE_STATS_RESOURCES_CPU || appState == STATE_STATS_RESOURCES_RAM ||
       appState == STATE_STATS_RESOURCES_FLASH || appState == STATE_STATS_RESOURCES ||
       appState == STATE_PMS5003_CF1 || appState == STATE_PMS5003_CF1_PM1 || appState == STATE_PMS5003_CF1_PM25 || appState == STATE_PMS5003_CF1_PM10 ||
       appState == STATE_PMS5003_ATM || appState == STATE_PMS5003_ATM_PM1 || appState == STATE_PMS5003_ATM_PM25 || appState == STATE_PMS5003_ATM_PM10 ||
       appState == STATE_PMS5003_PARTICLES || appState == STATE_PMS5003_PARTICLES_0_3 || appState == STATE_PMS5003_PARTICLES_0_5 || appState == STATE_PMS5003_PARTICLES_1_0 || appState == STATE_PMS5003_PARTICLES_2_5 || appState == STATE_PMS5003_PARTICLES_5_0 || appState == STATE_PMS5003_PARTICLES_10_0 ||
       appState == STATE_PMS5003_TELEMETRY ||
       appState == STATE_ENS160_AHT21 || appState == STATE_ENS160_AHT21_SUMMARY || appState == STATE_ENS160_AHT21_GAS ||
       appState == STATE_ENS160_AHT21_GAS_AQI || appState == STATE_ENS160_AHT21_GAS_TVOC || appState == STATE_ENS160_AHT21_GAS_ECO2 ||
       appState == STATE_ENS160_AHT21_CLIMATE || appState == STATE_ENS160_AHT21_CLIMATE_TEMP || appState == STATE_ENS160_AHT21_CLIMATE_HUM ||
       appState == STATE_ENS160_AHT21_STATUS ||
       appState == STATE_BMP280 || appState == STATE_BMP280_TEMP || appState == STATE_BMP280_PRESSURE ||
       appState == STATE_BMP280_STATUS || appState == STATE_BMP280_ALTITUDE) &&
      (nowMs - lastStatsRedraw >= 1000UL)) {
    lastStatsRedraw = nowMs;
    drawStats();
  }

  static unsigned long lastTimerRedraw = 0;
  if (appState == STATE_TIMER && (nowMs - lastTimerRedraw >= 1000UL)) {
    lastTimerRedraw = nowMs;
    if (timerRunning || editState == EDIT_DONE) {
      drawTimer();
    }
  }

  recordMaxU32(s_loopBaseline.maxUiRefreshUs, deltaUs(refreshStartUs, micros()));
}

