Fese673/ZEGAR-ESP32/src/main.cpp
static void serviceDiagnostics(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  static unsigned long last_status_diag = 0;
  if (!ModeManager::isBtOn() && (nowMs - last_status_diag >= 2000UL)) {
    last_status_diag = nowMs;
    static uint32_t last_heap = 0;
    const uint32_t current_heap = ESP.getFreeHeap();
    const int heap_delta = (int)current_heap - (int)last_heap;
    last_heap = current_heap;

    Serial.printf("[STATUS] WiFi:%s MQTT:%s BT:%s Heap:%u (%+d) Mode:%s\n",
                  ModeManager::isWifiOn() ? "ON" : "OFF",
                  NetworkOrchestrator::isMqttInitialized() ? "ON" : "OFF",
                  ModeManager::isBtOn() ? "ON" : "OFF",
                  current_heap,
                  heap_delta,
                  (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) ? "BT" : "WiFi");
  }

#if ENABLE_RUNTIME_TELEMETRY
  RuntimeTelemetry::service(Serial, nowMs);
#endif

  RamTelemetry::service(Serial, nowMs);

#if CORE_DEBUG_LEVEL > 0
  static bool lcdTimingPrimed = false;
  static unsigned long lastLcdTimingReport = 0;
  constexpr unsigned long LCD_TIMING_WINDOW_MS = 30000UL;
  if (!lcdTimingPrimed && nowMs >= LCD_TIMING_WINDOW_MS) {
    lcdFrame.resetStats();
    lcdTimingPrimed = true;
    lastLcdTimingReport = nowMs;
  }
  if (lcdTimingPrimed && (nowMs - lastLcdTimingReport >= LCD_TIMING_WINDOW_MS)) {
    lastLcdTimingReport = nowMs;
    lcdFrame.reportTiming("runtime");
    lcdFrame.resetStats();
  }
#endif
}

static void serviceComms(RuntimeContext& ctx, unsigned long nowMs) {
  ClockAlarmService::tickClock(CLOCK_TICK_MS, BUZZER_PIN);
  ClockAlarmService::serviceAlarmPlayback(BUZZER_PIN, ALARM_DURATION_MS);

  NetworkOrchestrator::setMqttEnabled(ctx.mqttEnabled);
  const uint32_t netStartUs = micros();
  NetworkOrchestrator::update();
  recordMaxU32(s_loopBaseline.maxNetworkUpdateUs, deltaUs(netStartUs, micros()));

  RtcSyncService::processPendingWrite();

  if (ctx.mqttEnabled && NetworkOrchestrator::isMqttInitialized()) {
    static unsigned long lastMQTTPublish = 0;
    if (nowMs - lastMQTTPublish >= 5000UL) {
      lastMQTTPublish = nowMs;
      const uint32_t mqttStartUs = micros();
      TelemetryComposer::Sample sample;
      TelemetryComposer::buildMqttTelemetrySample(sample);
      MQTTSync::publishSensorData(sample.temperatureC,
                                  sample.humidityPct,
                                  sample.pressureHpa,
                                  sample.aqi,
                                  sample.tvoc,
                                  sample.eco2);
      recordMaxU32(s_loopBaseline.maxMqttPublishUs, deltaUs(mqttStartUs, micros()));
    }
  }

  if (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }
}

static void serviceStm32AndStopwatch(RuntimeContext& ctx, unsigned long nowMs) {
  if (appState == STATE_DEBUG_STM32 && (nowMs - ctx.state.lastSTM32Update >= STM32_UPDATE_MS)) {
    ctx.state.lastSTM32Update = nowMs;
    STM32data_update();

    if (stmDataUpdated) {
      stmDataUpdated = false;
      displayedBPM = bpmNumber;
      displayedSPO2 = spo2Number;
      stm32Connected = true;
      ctx.state.lastSTM32DataReceived = nowMs;
    } else if (nowMs - ctx.state.lastSTM32DataReceived > STM32_TIMEOUT_MS) {
      stm32Connected = false;
      displayedBPM = 0;
      displayedSPO2 = 0;
    }

    drawDebugSTM32();
  }

  if (appState == STATE_STOPER && (nowMs - ctx.state.lastStoperDraw >= STOPER_DRAW_MS)) {
    ctx.state.lastStoperDraw = nowMs;
    drawStoper();
  }
}

static void serviceDiagnosticsTail(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  static unsigned long lastBtCheck = 0;
  if (nowMs - lastBtCheck > 60000UL) {
    lastBtCheck = nowMs;
    Serial.print("BT Connected: ");
    Serial.println(audioBT_isConnected() ? "TAK" : "NIE");
  }
}

// ============================================================================
// LOOP
// ============================================================================

void loop() {
  if (serviceEpicBootSequence()) {
    return;
  }

  static RuntimeContext ctx = makeRuntimeContext();
  const unsigned long nowMs = millis();
  const uint32_t loopStartUs = micros();
  baselineOnLoopStart(nowMs, loopStartUs);

  serviceBootDiagnostics(ctx, nowMs);
  serviceInputAndUiEvents(ctx, nowMs);
  serviceUiRefreshPreSensors(ctx, nowMs);
  serviceSensors(ctx, nowMs);
  serviceUiRefresh(ctx, nowMs);
  serviceDiagnostics(ctx, nowMs);
  serviceComms(ctx, nowMs);
  serviceStm32AndStopwatch(ctx, nowMs);
  serviceDiagnosticsTail(ctx, nowMs);

  baselineOnLoopEnd(nowMs, loopStartUs, micros());
}
